trunk/PWS/HWs/Project/BookStoreComposite/test/TestCase2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:book="BookStoreComposite">
  <soapenv:Body>
    <book:ClientCompositeOperation>
      <username>user1</username>
      <password>pass12</password>
      <bookSearchTerm>?string?</bookSearchTerm>
      <creditCardNumber>?string?</creditCardNumber>
    </book:ClientCompositeOperation>
  </soapenv:Body>
</soapenv:Envelope>